cf/Catalogs/ХранилищеФайловЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ХранилищеФайловЗаказов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/ХранилищеФайловЗаказов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	#Если ВебКлиент Тогда
	// Подключаем расширение работы с файлами
	Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
		// Если подключить расширение не удалось - устанавливаем его
		УстановитьРасширениеРаботыСФайлами();
		// и подключаем
		ПодключитьРасширениеРаботыСФайлами();
	КонецЕсли;
	#КонецЕсли

	// Вызываем диалог выбора файла на диске
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Фильтр    = "Текстовый документ(*.txt)|*.txt|Word(*.doc)|*.doc|Текстовый документ(*.pdf)|*.pdf|Текстовый документ с расширением txt в любом регистре|*.[tT][xX][tT]";
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";

	НачатьПомещениеФайлов(Новый ОписаниеОповещения("ПриемФайлов",ЭтаФорма),,ДиалогОткрытияФайла,Истина,УникальныйИдентификатор);
	ЭтаФорма.Модифицированность = Истина;
	            
КонецПроцедуры

&НаКлиенте
Процедура ПриемФайлов(ПомещенныеФайлы, ДополнительныеПараметры)  Экспорт
	
	Если ПомещенныеФайлы = Неопределено Тогда 
		Текст = "ru = ""Файл не выбран!""; en = ""File not selected!""";
		Предупреждение(НСтр(Текст));
        Возврат; 
	КонецЕсли;
	
		ПутьКФайлуРеквизитФормы = ПомещенныеФайлы[0].Хранение;    //Адрес
		
		МассивНаш         = СтрРазделить(ПомещенныеФайлы[0].Имя,"\",);
		Объект.ИмяФайла   = МассивНаш[МассивНаш.ВГраница()];
		МассивДляРасширен = СтрРазделить(МассивНаш[МассивНаш.ВГраница()],".",);
		Объект.Расширение = МассивДляРасширен[МассивДляРасширен.ВГраница()];

		ПрикрепитьФайлСервер(ПомещенныеФайлы);

	КонецПроцедуры
	
&НаСервере
Процедура ПрикрепитьФайлСервер(Данные, ЭтоВебКлиент = Ложь) 
	
	// Конвертируем объект формы в объект справочника "Файлы"
	Об = РеквизитФормыВЗначение("Объект");
	// Записываем двоичные данные в реквизит "Хранилище"
	Об.Хранилище = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ПутьКФайлуРеквизитФормы));
	// Сохраняем изменения 
	Об.Записать();
	// Возвращаем обновленный объект справочника в форму
	ЗначениеВРеквизитФормы(Об, "Объект");   	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
   #Если ВебКлиент Тогда
		// Подключаем расширение работы с файлами
		Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
			// Если подключить расширение не удалось - устанавливаем его
			УстановитьРасширениеРаботыСФайлами();
			// и подключаем
			ПодключитьРасширениеРаботыСФайлами();
		КонецЕсли;
	#КонецЕсли
	
	ДвДанн = ПолучитьДанные();
	
	ПередаваемыеФайлы = Новый Массив;
	Описание = Новый ОписаниеПередаваемогоФайла(Объект.ИмяФайла,ДвДанн);

	ПередаваемыеФайлы.Добавить(Описание);

	НачатьПолучениеФайлов(Новый ОписаниеОповещения("ПрочитатьФайл",ЭтаФорма),ПередаваемыеФайлы,КаталогВременныхФайлов() ,Ложь );
   КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(ПолученныеФайлы, ДополнительныеПараметры)  Экспорт
	
	Если ПолученныеФайлы = Неопределено Тогда Возврат; 
	КонецЕсли;
	
	Для Каждого Стр Из ПолученныеФайлы Цикл
		НачатьЗапускПриложения(Новый ОписаниеОповещения("ОткрытьВыбранныйФайл",ЭтаФорма),Стр.Имя,,);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВыбранныйФайл(КодВозврата, ДополнительныеПараметры)  Экспорт
	
	Если КодВозврата = Неопределено Тогда Возврат; 
	КонецЕсли;
	
КонецПроцедуры



&НаСервере                                        
Функция ПолучитьДанные()
	
	НашОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ПоместитьВоВременноеХранилище(НашОбъект.Хранилище.Получить(), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Заказ = ЭтаФорма.Параметры.ЗначенияЗаполнения.Заказ;
	КонецЕсли;
	GUID = Объект.Ссылка.УникальныйИдентификатор();
КонецПроцедуры
